---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.ShowGridLines
source: html/64a5e8a6-edec-a530-4c32-b6d840ddfd52.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.ShowGridLines Property

If true, show grid lines in the analysis display.

## Syntax (C#)
```csharp
public bool ShowGridLines { get; set; }
```